# ShouldHideWhenNoValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SharedParameterElement..::..ShouldHideWhenNoValue Method
SharedParameterElement Class See Also
---
Indicates whether the parameter should be hidden from the properties palette if it has no value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool ShouldHideWhenNoValue()
```

Visual Basic
---
```text
Public Function ShouldHideWhenNoValue As Boolean
```

Visual C++
---
```text
public:
bool ShouldHideWhenNoValue()
```

# See Also
SharedParameterElement Class
Autodesk.Revit.DB Namespace